{"metadata": {"total_size": 9289722624}, "weight_map": {"adaln_proj.bias": "diffusion_pytorch_model.safetensors", "adaln_proj.weight": "diffusion_pytorch_model.safetensors", "adaln_proj.weight_scale": "diffusion_pytorch_model.safetensors", "embed_image_indicator.weight": "diffusion_pytorch_model.safetensors", "final_layer.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "final_layer.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "final_layer.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "final_layer.linear.bias": "diffusion_pytorch_model.safetensors", "final_layer.linear.weight": "diffusion_pytorch_model.safetensors", "final_layer.linear.weight_scale": "diffusion_pytorch_model.safetensors", "input_proj.bias": "diffusion_pytorch_model.safetensors", "input_proj.weight": "diffusion_pytorch_model.safetensors", "input_proj.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.0.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.0.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.0.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.0.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.0.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.0.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.0.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.0.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.0.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.0.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.1.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.1.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.1.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.1.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.1.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.1.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.1.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.1.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.1.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.1.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.1.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.10.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.10.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.10.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.10.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.10.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.10.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.10.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.10.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.10.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.10.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.10.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.11.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.11.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.11.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.11.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.11.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.11.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.11.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.11.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.11.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.11.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.11.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.12.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.12.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.12.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.12.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.12.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.12.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.12.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.12.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.12.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.12.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.12.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.13.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.13.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.13.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.13.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.13.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.13.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.13.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.13.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.13.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.13.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.13.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.14.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.14.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.14.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.14.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.14.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.14.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.14.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.14.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.14.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.14.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.14.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.15.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.15.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.15.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.15.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.15.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.15.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.15.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.15.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.15.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.15.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.15.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.16.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.16.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.16.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.16.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.16.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.16.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.16.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.16.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.16.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.16.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.16.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.17.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.17.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.17.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.17.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.17.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.17.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.17.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.17.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.17.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.17.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.17.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.18.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.18.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.18.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.18.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.18.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.18.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.18.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.18.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.18.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.18.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.18.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.19.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.19.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.19.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.19.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.19.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.19.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.19.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.19.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.19.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.19.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.19.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.2.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.2.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.2.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.2.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.2.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.2.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.2.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.2.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.2.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.2.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.2.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.20.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.20.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.20.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.20.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.20.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.20.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.20.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.20.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.20.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.20.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.20.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.21.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.21.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.21.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.21.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.21.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.21.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.21.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.21.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.21.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.21.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.21.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.22.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.22.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.22.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.22.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.22.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.22.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.22.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.22.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.22.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.22.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.22.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.23.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.23.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.23.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.23.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.23.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.23.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.23.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.23.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.23.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.23.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.23.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.24.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.24.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.24.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.24.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.24.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.24.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.24.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.24.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.24.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.24.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.24.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.25.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.25.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.25.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.25.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.25.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.25.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.25.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.25.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.25.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.25.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.25.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.26.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.26.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.26.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.26.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.26.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.26.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.26.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.26.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.26.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.26.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.26.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.27.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.27.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.27.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.27.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.27.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.27.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.27.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.27.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.27.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.27.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.27.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.28.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.28.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.28.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.28.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.28.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.28.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.28.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.28.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.28.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.28.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.28.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.29.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.29.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.29.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.29.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.29.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.29.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.29.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.29.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.29.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.29.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.29.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.3.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.3.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.3.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.3.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.3.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.3.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.3.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.3.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.3.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.3.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.3.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.30.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.30.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.30.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.30.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.30.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.30.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.30.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.30.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.30.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.30.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.30.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.31.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.31.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.31.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.31.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.31.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.31.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.31.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.31.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.31.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.31.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.31.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.32.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.32.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.32.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.32.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.32.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.32.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.32.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.32.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.32.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.32.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.32.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.33.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.33.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.33.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.33.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.33.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.33.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.33.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.33.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.33.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.33.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.33.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.4.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.4.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.4.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.4.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.4.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.4.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.4.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.4.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.4.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.4.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.4.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.5.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.5.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.5.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.5.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.5.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.5.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.5.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.5.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.5.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.5.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.5.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.6.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.6.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.6.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.6.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.6.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.6.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.6.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.6.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.6.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.6.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.6.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.7.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.7.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.7.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.7.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.7.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.7.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.7.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.7.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.7.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.7.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.7.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.8.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.8.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.8.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.8.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.8.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.8.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.8.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.8.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.8.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.8.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.8.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.9.adaln_modulation.bias": "diffusion_pytorch_model.safetensors", "layers.9.adaln_modulation.weight": "diffusion_pytorch_model.safetensors", "layers.9.adaln_modulation.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.attention.norm_k.weight": "diffusion_pytorch_model.safetensors", "layers.9.attention.norm_q.weight": "diffusion_pytorch_model.safetensors", "layers.9.attention.o.weight": "diffusion_pytorch_model.safetensors", "layers.9.attention.o.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.attention.qkv.weight": "diffusion_pytorch_model.safetensors", "layers.9.attention.qkv.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.attention_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.9.attention_norm2.weight": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w1.weight": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w1.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w2.weight": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w2.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w3.weight": "diffusion_pytorch_model.safetensors", "layers.9.feed_forward.w3.weight_scale": "diffusion_pytorch_model.safetensors", "layers.9.ffn_norm1.weight": "diffusion_pytorch_model.safetensors", "layers.9.ffn_norm2.weight": "diffusion_pytorch_model.safetensors", "llm_cond_norm.weight": "diffusion_pytorch_model.safetensors", "llm_cond_proj.bias": "diffusion_pytorch_model.safetensors", "llm_cond_proj.weight": "diffusion_pytorch_model.safetensors", "llm_cond_proj.weight_scale": "diffusion_pytorch_model.safetensors", "t_embedding.mlp_in.bias": 